; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph2 - mode
	image0 - mode
	thermograph1 - mode
	spectrograph3 - mode
	Star2 - direction
	GroundStation1 - direction
	Star0 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
	(supports instrument3 thermograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star3)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument8 image0)
	(calibration_target instrument8 Star3)
	(supports instrument9 spectrograph3)
	(supports instrument9 thermograph1)
	(supports instrument9 image0)
	(calibration_target instrument9 Star4)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon5)
)
(:goal (and
	(have_image Phenomenon5 thermograph1)
	(have_image Star6 thermograph1)
	(have_image Star7 spectrograph3)
	(have_image Phenomenon8 image0)
	(have_image Phenomenon9 image0)
	(have_image Star10 spectrograph3)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 thermograph2)
))

(:metric minimize (total-time))
)

; plan
1. (switch-on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 10
2. (turn-to satellite0 star4 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star4)
   goals met: 0 of 10
3. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn-to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   goals met: 0 of 10
5. (take-image satellite0 star7 instrument2 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 1 of 10
6. (turn-to satellite0 star10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star10)
   goals met: 1 of 10
7. (take-image satellite0 star10 instrument2 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 2 of 10
8. (switch-on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 2 of 10
9. (turn-to satellite2 star0 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star0)
   goals met: 2 of 10
10. (calibrate satellite2 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 2 of 10
11. (turn-to satellite2 phenomenon8 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon8)
   goals met: 2 of 10
12. (take-image satellite2 phenomenon8 instrument7 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 10
13. (turn-to satellite2 phenomenon9 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 10
14. (take-image satellite2 phenomenon9 instrument7 image0)
   added: (have_image phenomenon9 image0)
   goals met: 4 of 10
15. (turn-to satellite2 planet11 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet11)
   goals met: 4 of 10
16. (take-image satellite2 planet11 instrument7 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 5 of 10
17. (turn-to satellite2 phenomenon12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon12)
   goals met: 5 of 10
18. (take-image satellite2 phenomenon12 instrument7 image0)
   added: (have_image phenomenon12 image0)
   goals met: 6 of 10
19. (turn-to satellite2 phenomenon14 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon14)
   goals met: 6 of 10
20. (take-image satellite2 phenomenon14 instrument7 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 7 of 10
21. (turn-to satellite2 star6 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 star6)
   goals met: 7 of 10
22. (take-image satellite2 star6 instrument7 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 8 of 10
23. (turn-to satellite2 phenomenon13 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon13)
   goals met: 8 of 10
24. (take-image satellite2 phenomenon13 instrument7 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 9 of 10
25. (turn-to satellite2 phenomenon5 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon5)
   goals met: 9 of 10
26. (take-image satellite2 phenomenon5 instrument7 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 10 of 10
